https://medium.com/towards-data-science/3-silent-pandas-mistakes-you-should-be-aware-of-80d0112de6b5

In [1]:
import pandas as pd

promotion = pd.DataFrame(
    {
        "promotion_code": ["A2", "A1", "A2", "B1", "A2", None, "A2", "B1", None, "A1"],
        "sales_qty": [34, 32, 26, 71, 44, 27, 64, 33, 45, 90],
        "price": [24.5, 33.1, 64.9, 52.0, 29.0, 47.5, 44.2, 25.0, 42.5, 30.0]
    }
)

In [2]:
promotion.groupby("promotion_code").agg(
    
    total_promo_sales = ("sales_qty", "sum")

)

                total_promo_sales
promotion_code
A1                            122
A2                            168
B1                            104

In [3]:
promotion_sales = promotion.groupby("promotion_code").agg(
    total_promo_sales = ("sales_qty", "sum")
)

promotion_sales.total_promo_sales.sum() # output 394

promotion.sales_qty.sum() # output 466

466

In [4]:
promotion.groupby("promotion_code", dropna=False).agg(
    
    total_promo_sales = ("sales_qty", "sum")

)

                total_promo_sales
promotion_code
A1                            122
A2                            168
B1                            104
NaN                            72

In [5]:
promotion.iloc[:4, :]

  promotion_code  sales_qty  price
0             A2         34   24.5
1             A1         32   33.1
2             A2         26   64.9
3             B1         71   52.0